Model: "unet base"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 256, 256, 1) 0                                            
__________________________________________________________________________________________________
contraction_1_1 (Conv2D)        (None, 256, 256, 64) 640         input_1[0][0]                    
__________________________________________________________________________________________________
contraction_1_2 (Conv2D)        (None, 256, 256, 64) 36928       contraction_1_1[0][0]            
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 128, 128, 64) 0           contraction_1_2[0][0]            
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 128, 128, 64) 256         max_pooling2d[0][0]              
__________________________________________________________________________________________________
dropout (Dropout)               (None, 128, 128, 64) 0           batch_normalization[0][0]        
__________________________________________________________________________________________________
contraction_2_1_1 (Conv2D)      (None, 128, 128, 128 73856       dropout[0][0]                    
__________________________________________________________________________________________________
contraction_2_1_2 (Conv2D)      (None, 128, 128, 128 147584      contraction_2_1_1[0][0]          
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 64, 64, 128)  0           contraction_2_1_2[0][0]          
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 64, 64, 128)  512         max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 64, 64, 128)  0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
contraction_3_1_1 (Conv2D)      (None, 64, 64, 256)  295168      dropout_1[0][0]                  
__________________________________________________________________________________________________
contraction_3_1_2 (Conv2D)      (None, 64, 64, 256)  590080      contraction_3_1_1[0][0]          
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 32, 32, 256)  0           contraction_3_1_2[0][0]          
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 32, 32, 256)  1024        max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 32, 32, 256)  0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
contraction_4_1_1 (Conv2D)      (None, 32, 32, 512)  1180160     dropout_2[0][0]                  
__________________________________________________________________________________________________
contraction_4_1_2 (Conv2D)      (None, 32, 32, 512)  2359808     contraction_4_1_1[0][0]          
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 16, 16, 512)  0           contraction_4_1_2[0][0]          
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 16, 16, 512)  2048        max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 16, 16, 512)  0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
contraction_5_1_1 (Conv2D)      (None, 16, 16, 512)  2359808     dropout_3[0][0]                  
__________________________________________________________________________________________________
contraction_5_1_2 (Conv2D)      (None, 16, 16, 512)  2359808     contraction_5_1_1[0][0]          
__________________________________________________________________________________________________
conv2d_transpose (Conv2DTranspo (None, 32, 32, 512)  2359808     contraction_5_1_2[0][0]          
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 32, 32, 1024) 0           conv2d_transpose[0][0]           
                                                                 contraction_4_1_2[0][0]          
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 32, 32, 1024) 0           concatenate[0][0]                
__________________________________________________________________________________________________
expansion_1_1 (Conv2D)          (None, 32, 32, 512)  4719104     dropout_4[0][0]                  
__________________________________________________________________________________________________
expansion_1_2 (Conv2D)          (None, 32, 32, 512)  2359808     expansion_1_1[0][0]              
__________________________________________________________________________________________________
conv2d_transpose_1 (Conv2DTrans (None, 64, 64, 256)  1179904     expansion_1_2[0][0]              
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 64, 64, 512)  0           conv2d_transpose_1[0][0]         
                                                                 contraction_3_1_2[0][0]          
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 64, 64, 512)  0           concatenate_1[0][0]              
__________________________________________________________________________________________________
expansion_2_1 (Conv2D)          (None, 64, 64, 256)  1179904     dropout_5[0][0]                  
__________________________________________________________________________________________________
expansion_2_2 (Conv2D)          (None, 64, 64, 256)  590080      expansion_2_1[0][0]              
__________________________________________________________________________________________________
conv2d_transpose_2 (Conv2DTrans (None, 128, 128, 128 295040      expansion_2_2[0][0]              
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 128, 128, 256 0           conv2d_transpose_2[0][0]         
                                                                 contraction_2_1_2[0][0]          
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, 128, 128, 256 0           concatenate_2[0][0]              
__________________________________________________________________________________________________
expansion_3_1 (Conv2D)          (None, 128, 128, 128 295040      dropout_6[0][0]                  
__________________________________________________________________________________________________
expansion_3_2 (Conv2D)          (None, 128, 128, 128 147584      expansion_3_1[0][0]              
__________________________________________________________________________________________________
conv2d_transpose_3 (Conv2DTrans (None, 256, 256, 64) 73792       expansion_3_2[0][0]              
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 256, 256, 128 0           conv2d_transpose_3[0][0]         
                                                                 contraction_1_2[0][0]            
__________________________________________________________________________________________________
dropout_7 (Dropout)             (None, 256, 256, 128 0           concatenate_3[0][0]              
__________________________________________________________________________________________________
expansion_4_1 (Conv2D)          (None, 256, 256, 64) 73792       dropout_7[0][0]                  
__________________________________________________________________________________________________
expansion_4_2 (Conv2D)          (None, 256, 256, 64) 36928       expansion_4_1[0][0]              
__________________________________________________________________________________________________
output (Conv2D)                 (None, 256, 256, 1)  65          expansion_4_2[0][0]              
==================================================================================================
Total params: 22,718,529
Trainable params: 22,716,609
Non-trainable params: 1,920