Model: "unet_v5"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 256, 256, 1) 0                                            
__________________________________________________________________________________________________
contraction_1_1 (Conv2D)        (None, 256, 256, 20) 200         input_1[0][0]                    
__________________________________________________________________________________________________
contraction_1_2 (Conv2D)        (None, 256, 256, 20) 3620        contraction_1_1[0][0]            
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 128, 128, 20) 0           contraction_1_2[0][0]            
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 128, 128, 20) 80          max_pooling2d[0][0]              
__________________________________________________________________________________________________
dropout (Dropout)               (None, 128, 128, 20) 0           batch_normalization[0][0]        
__________________________________________________________________________________________________
contraction_2_1_1 (Conv2D)      (None, 128, 128, 41) 7421        dropout[0][0]                    
__________________________________________________________________________________________________
contraction_2_1_2 (Conv2D)      (None, 128, 128, 41) 15170       contraction_2_1_1[0][0]          
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 64, 64, 41)   0           contraction_2_1_2[0][0]          
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 64, 64, 41)   164         max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 64, 64, 41)   0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
contraction_3_1_1 (Conv2D)      (None, 64, 64, 83)   30710       dropout_1[0][0]                  
__________________________________________________________________________________________________
contraction_3_1_2 (Conv2D)      (None, 64, 64, 83)   62084       contraction_3_1_1[0][0]          
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 32, 32, 83)   0           contraction_3_1_2[0][0]          
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 32, 32, 83)   332         max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 32, 32, 83)   0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
contraction_4_1_1 (Conv2D)      (None, 32, 32, 166)  124168      dropout_2[0][0]                  
__________________________________________________________________________________________________
contraction_4_1_2 (Conv2D)      (None, 32, 32, 166)  248170      contraction_4_1_1[0][0]          
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 16, 16, 166)  0           contraction_4_1_2[0][0]          
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 16, 16, 166)  664         max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 16, 16, 166)  0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
contraction_5_1_1 (Conv2D)      (None, 16, 16, 332)  496340      dropout_3[0][0]                  
__________________________________________________________________________________________________
contraction_5_1_2 (Conv2D)      (None, 16, 16, 332)  992348      contraction_5_1_1[0][0]          
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 8, 8, 332)    0           contraction_5_1_2[0][0]          
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 8, 8, 332)    1328        max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 8, 8, 332)    0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
contraction_6_1_1 (Conv2D)      (None, 8, 8, 665)    1987685     dropout_4[0][0]                  
__________________________________________________________________________________________________
contraction_6_1_2 (Conv2D)      (None, 8, 8, 665)    3980690     contraction_6_1_1[0][0]          
__________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)  (None, 4, 4, 665)    0           contraction_6_1_2[0][0]          
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 4, 4, 665)    2660        max_pooling2d_5[0][0]            
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 4, 4, 665)    0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
contraction_7_1_1 (Conv2D)      (None, 4, 4, 665)    3980690     dropout_5[0][0]                  
__________________________________________________________________________________________________
contraction_7_1_2 (Conv2D)      (None, 4, 4, 665)    3980690     contraction_7_1_1[0][0]          
__________________________________________________________________________________________________
conv2d_transpose (Conv2DTranspo (None, 8, 8, 665)    3980690     contraction_7_1_2[0][0]          
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 8, 8, 1330)   0           conv2d_transpose[0][0]           
                                                                 contraction_6_1_2[0][0]          
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, 8, 8, 1330)   0           concatenate[0][0]                
__________________________________________________________________________________________________
expansion_1_1 (Conv2D)          (None, 8, 8, 665)    7960715     dropout_6[0][0]                  
__________________________________________________________________________________________________
expansion_1_2 (Conv2D)          (None, 8, 8, 665)    3980690     expansion_1_1[0][0]              
__________________________________________________________________________________________________
conv2d_transpose_1 (Conv2DTrans (None, 16, 16, 332)  1987352     expansion_1_2[0][0]              
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 16, 16, 664)  0           conv2d_transpose_1[0][0]         
                                                                 contraction_5_1_2[0][0]          
__________________________________________________________________________________________________
dropout_7 (Dropout)             (None, 16, 16, 664)  0           concatenate_1[0][0]              
__________________________________________________________________________________________________
expansion_2_1 (Conv2D)          (None, 16, 16, 332)  1984364     dropout_7[0][0]                  
__________________________________________________________________________________________________
expansion_2_2 (Conv2D)          (None, 16, 16, 332)  992348      expansion_2_1[0][0]              
__________________________________________________________________________________________________
conv2d_transpose_2 (Conv2DTrans (None, 32, 32, 166)  496174      expansion_2_2[0][0]              
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 32, 32, 332)  0           conv2d_transpose_2[0][0]         
                                                                 contraction_4_1_2[0][0]          
__________________________________________________________________________________________________
dropout_8 (Dropout)             (None, 32, 32, 332)  0           concatenate_2[0][0]              
__________________________________________________________________________________________________
expansion_3_1 (Conv2D)          (None, 32, 32, 166)  496174      dropout_8[0][0]                  
__________________________________________________________________________________________________
expansion_3_2 (Conv2D)          (None, 32, 32, 166)  248170      expansion_3_1[0][0]              
__________________________________________________________________________________________________
conv2d_transpose_3 (Conv2DTrans (None, 64, 64, 83)   124085      expansion_3_2[0][0]              
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 64, 64, 166)  0           conv2d_transpose_3[0][0]         
                                                                 contraction_3_1_2[0][0]          
__________________________________________________________________________________________________
dropout_9 (Dropout)             (None, 64, 64, 166)  0           concatenate_3[0][0]              
__________________________________________________________________________________________________
expansion_4_1 (Conv2D)          (None, 64, 64, 83)   124085      dropout_9[0][0]                  
__________________________________________________________________________________________________
expansion_4_2 (Conv2D)          (None, 64, 64, 83)   62084       expansion_4_1[0][0]              
__________________________________________________________________________________________________
conv2d_transpose_4 (Conv2DTrans (None, 128, 128, 41) 30668       expansion_4_2[0][0]              
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 128, 128, 82) 0           conv2d_transpose_4[0][0]         
                                                                 contraction_2_1_2[0][0]          
__________________________________________________________________________________________________
dropout_10 (Dropout)            (None, 128, 128, 82) 0           concatenate_4[0][0]              
__________________________________________________________________________________________________
expansion_5_1 (Conv2D)          (None, 128, 128, 41) 30299       dropout_10[0][0]                 
__________________________________________________________________________________________________
expansion_5_2 (Conv2D)          (None, 128, 128, 41) 15170       expansion_5_1[0][0]              
__________________________________________________________________________________________________
conv2d_transpose_5 (Conv2DTrans (None, 256, 256, 20) 7400        expansion_5_2[0][0]              
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, 256, 256, 40) 0           conv2d_transpose_5[0][0]         
                                                                 contraction_1_2[0][0]            
__________________________________________________________________________________________________
dropout_11 (Dropout)            (None, 256, 256, 40) 0           concatenate_5[0][0]              
__________________________________________________________________________________________________
expansion_6_1 (Conv2D)          (None, 256, 256, 20) 7220        dropout_11[0][0]                 
__________________________________________________________________________________________________
expansion_6_2 (Conv2D)          (None, 256, 256, 20) 3620        expansion_6_1[0][0]              
__________________________________________________________________________________________________
output (Conv2D)                 (None, 256, 256, 1)  21          expansion_6_2[0][0]              
==================================================================================================
Total params: 38,446,543
Trainable params: 38,443,929
Non-trainable params: 2,614
__________________________________________________________________________________________________
