Model: "unet_v5"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 256, 256, 1) 0                                            
__________________________________________________________________________________________________
contraction_1_1 (Conv2D)        (None, 256, 256, 24) 240         input_2[0][0]                    
__________________________________________________________________________________________________
contraction_1_2 (Conv2D)        (None, 256, 256, 24) 5208        contraction_1_1[0][0]            
__________________________________________________________________________________________________
max_pooling2d_6 (MaxPooling2D)  (None, 128, 128, 24) 0           contraction_1_2[0][0]            
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 128, 128, 24) 96          max_pooling2d_6[0][0]            
__________________________________________________________________________________________________
dropout_12 (Dropout)            (None, 128, 128, 24) 0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
contraction_2_1_1 (Conv2D)      (None, 128, 128, 48) 10416       dropout_12[0][0]                 
__________________________________________________________________________________________________
contraction_2_1_2 (Conv2D)      (None, 128, 128, 48) 20784       contraction_2_1_1[0][0]          
__________________________________________________________________________________________________
max_pooling2d_7 (MaxPooling2D)  (None, 64, 64, 48)   0           contraction_2_1_2[0][0]          
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 64, 64, 48)   192         max_pooling2d_7[0][0]            
__________________________________________________________________________________________________
dropout_13 (Dropout)            (None, 64, 64, 48)   0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
contraction_3_1_1 (Conv2D)      (None, 64, 64, 96)   41568       dropout_13[0][0]                 
__________________________________________________________________________________________________
contraction_3_1_2 (Conv2D)      (None, 64, 64, 96)   83040       contraction_3_1_1[0][0]          
__________________________________________________________________________________________________
max_pooling2d_8 (MaxPooling2D)  (None, 32, 32, 96)   0           contraction_3_1_2[0][0]          
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 32, 32, 96)   384         max_pooling2d_8[0][0]            
__________________________________________________________________________________________________
dropout_14 (Dropout)            (None, 32, 32, 96)   0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
contraction_4_1_1 (Conv2D)      (None, 32, 32, 192)  166080      dropout_14[0][0]                 
__________________________________________________________________________________________________
contraction_4_1_2 (Conv2D)      (None, 32, 32, 192)  331968      contraction_4_1_1[0][0]          
__________________________________________________________________________________________________
max_pooling2d_9 (MaxPooling2D)  (None, 16, 16, 192)  0           contraction_4_1_2[0][0]          
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 16, 16, 192)  768         max_pooling2d_9[0][0]            
__________________________________________________________________________________________________
dropout_15 (Dropout)            (None, 16, 16, 192)  0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
contraction_5_1_1 (Conv2D)      (None, 16, 16, 384)  663936      dropout_15[0][0]                 
__________________________________________________________________________________________________
contraction_5_1_2 (Conv2D)      (None, 16, 16, 384)  1327488     contraction_5_1_1[0][0]          
__________________________________________________________________________________________________
max_pooling2d_10 (MaxPooling2D) (None, 8, 8, 384)    0           contraction_5_1_2[0][0]          
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 8, 8, 384)    1536        max_pooling2d_10[0][0]           
__________________________________________________________________________________________________
dropout_16 (Dropout)            (None, 8, 8, 384)    0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
contraction_6_1_1 (Conv2D)      (None, 8, 8, 768)    2654976     dropout_16[0][0]                 
__________________________________________________________________________________________________
contraction_6_1_2 (Conv2D)      (None, 8, 8, 768)    5309184     contraction_6_1_1[0][0]          
__________________________________________________________________________________________________
max_pooling2d_11 (MaxPooling2D) (None, 4, 4, 768)    0           contraction_6_1_2[0][0]          
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 4, 4, 768)    3072        max_pooling2d_11[0][0]           
__________________________________________________________________________________________________
dropout_17 (Dropout)            (None, 4, 4, 768)    0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
contraction_7_1_1 (Conv2D)      (None, 4, 4, 768)    5309184     dropout_17[0][0]                 
__________________________________________________________________________________________________
contraction_7_1_2 (Conv2D)      (None, 4, 4, 768)    5309184     contraction_7_1_1[0][0]          
__________________________________________________________________________________________________
conv2d_transpose_6 (Conv2DTrans (None, 8, 8, 768)    5309184     contraction_7_1_2[0][0]          
__________________________________________________________________________________________________
concatenate_6 (Concatenate)     (None, 8, 8, 1536)   0           conv2d_transpose_6[0][0]         
                                                                 contraction_6_1_2[0][0]          
__________________________________________________________________________________________________
dropout_18 (Dropout)            (None, 8, 8, 1536)   0           concatenate_6[0][0]              
__________________________________________________________________________________________________
expansion_1_1 (Conv2D)          (None, 8, 8, 768)    10617600    dropout_18[0][0]                 
__________________________________________________________________________________________________
expansion_1_2 (Conv2D)          (None, 8, 8, 768)    5309184     expansion_1_1[0][0]              
__________________________________________________________________________________________________
conv2d_transpose_7 (Conv2DTrans (None, 16, 16, 384)  2654592     expansion_1_2[0][0]              
__________________________________________________________________________________________________
concatenate_7 (Concatenate)     (None, 16, 16, 768)  0           conv2d_transpose_7[0][0]         
                                                                 contraction_5_1_2[0][0]          
__________________________________________________________________________________________________
dropout_19 (Dropout)            (None, 16, 16, 768)  0           concatenate_7[0][0]              
__________________________________________________________________________________________________
expansion_2_1 (Conv2D)          (None, 16, 16, 384)  2654592     dropout_19[0][0]                 
__________________________________________________________________________________________________
expansion_2_2 (Conv2D)          (None, 16, 16, 384)  1327488     expansion_2_1[0][0]              
__________________________________________________________________________________________________
conv2d_transpose_8 (Conv2DTrans (None, 32, 32, 192)  663744      expansion_2_2[0][0]              
__________________________________________________________________________________________________
concatenate_8 (Concatenate)     (None, 32, 32, 384)  0           conv2d_transpose_8[0][0]         
                                                                 contraction_4_1_2[0][0]          
__________________________________________________________________________________________________
dropout_20 (Dropout)            (None, 32, 32, 384)  0           concatenate_8[0][0]              
__________________________________________________________________________________________________
expansion_3_1 (Conv2D)          (None, 32, 32, 192)  663744      dropout_20[0][0]                 
__________________________________________________________________________________________________
expansion_3_2 (Conv2D)          (None, 32, 32, 192)  331968      expansion_3_1[0][0]              
__________________________________________________________________________________________________
conv2d_transpose_9 (Conv2DTrans (None, 64, 64, 96)   165984      expansion_3_2[0][0]              
__________________________________________________________________________________________________
concatenate_9 (Concatenate)     (None, 64, 64, 192)  0           conv2d_transpose_9[0][0]         
                                                                 contraction_3_1_2[0][0]          
__________________________________________________________________________________________________
dropout_21 (Dropout)            (None, 64, 64, 192)  0           concatenate_9[0][0]              
__________________________________________________________________________________________________
expansion_4_1 (Conv2D)          (None, 64, 64, 96)   165984      dropout_21[0][0]                 
__________________________________________________________________________________________________
expansion_4_2 (Conv2D)          (None, 64, 64, 96)   83040       expansion_4_1[0][0]              
__________________________________________________________________________________________________
conv2d_transpose_10 (Conv2DTran (None, 128, 128, 48) 41520       expansion_4_2[0][0]              
__________________________________________________________________________________________________
concatenate_10 (Concatenate)    (None, 128, 128, 96) 0           conv2d_transpose_10[0][0]        
                                                                 contraction_2_1_2[0][0]          
__________________________________________________________________________________________________
dropout_22 (Dropout)            (None, 128, 128, 96) 0           concatenate_10[0][0]             
__________________________________________________________________________________________________
expansion_5_1 (Conv2D)          (None, 128, 128, 48) 41520       dropout_22[0][0]                 
__________________________________________________________________________________________________
expansion_5_2 (Conv2D)          (None, 128, 128, 48) 20784       expansion_5_1[0][0]              
__________________________________________________________________________________________________
conv2d_transpose_11 (Conv2DTran (None, 256, 256, 24) 10392       expansion_5_2[0][0]              
__________________________________________________________________________________________________
concatenate_11 (Concatenate)    (None, 256, 256, 48) 0           conv2d_transpose_11[0][0]        
                                                                 contraction_1_2[0][0]            
__________________________________________________________________________________________________
dropout_23 (Dropout)            (None, 256, 256, 48) 0           concatenate_11[0][0]             
__________________________________________________________________________________________________
expansion_6_1 (Conv2D)          (None, 256, 256, 24) 10392       dropout_23[0][0]                 
__________________________________________________________________________________________________
expansion_6_2 (Conv2D)          (None, 256, 256, 24) 5208        expansion_6_1[0][0]              
__________________________________________________________________________________________________
output (Conv2D)                 (None, 256, 256, 1)  25          expansion_6_2[0][0]              
==================================================================================================
Total params: 51,316,249
Trainable params: 51,313,225
Non-trainable params: 3,024
__________________________________________________________________________________________________
