Model: "unet_v3"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_8 (InputLayer)            [(None, 256, 256, 1) 0                                            
__________________________________________________________________________________________________
contraction_1_1 (Conv2D)        (None, 256, 256, 28) 280         input_8[0][0]                    
__________________________________________________________________________________________________
contraction_1_2 (Conv2D)        (None, 256, 256, 28) 7084        contraction_1_1[0][0]            
__________________________________________________________________________________________________
max_pooling2d_42 (MaxPooling2D) (None, 128, 128, 28) 0           contraction_1_2[0][0]            
__________________________________________________________________________________________________
batch_normalization_42 (BatchNo (None, 128, 128, 28) 112         max_pooling2d_42[0][0]           
__________________________________________________________________________________________________
dropout_84 (Dropout)            (None, 128, 128, 28) 0           batch_normalization_42[0][0]     
__________________________________________________________________________________________________
contraction_2_1_1 (Conv2D)      (None, 128, 128, 57) 14421       dropout_84[0][0]                 
__________________________________________________________________________________________________
contraction_2_1_2 (Conv2D)      (None, 128, 128, 57) 29298       contraction_2_1_1[0][0]          
__________________________________________________________________________________________________
max_pooling2d_43 (MaxPooling2D) (None, 64, 64, 57)   0           contraction_2_1_2[0][0]          
__________________________________________________________________________________________________
batch_normalization_43 (BatchNo (None, 64, 64, 57)   228         max_pooling2d_43[0][0]           
__________________________________________________________________________________________________
dropout_85 (Dropout)            (None, 64, 64, 57)   0           batch_normalization_43[0][0]     
__________________________________________________________________________________________________
contraction_3_1_1 (Conv2D)      (None, 64, 64, 115)  59110       dropout_85[0][0]                 
__________________________________________________________________________________________________
contraction_3_1_2 (Conv2D)      (None, 64, 64, 115)  119140      contraction_3_1_1[0][0]          
__________________________________________________________________________________________________
max_pooling2d_44 (MaxPooling2D) (None, 32, 32, 115)  0           contraction_3_1_2[0][0]          
__________________________________________________________________________________________________
batch_normalization_44 (BatchNo (None, 32, 32, 115)  460         max_pooling2d_44[0][0]           
__________________________________________________________________________________________________
dropout_86 (Dropout)            (None, 32, 32, 115)  0           batch_normalization_44[0][0]     
__________________________________________________________________________________________________
contraction_4_1_1 (Conv2D)      (None, 32, 32, 230)  238280      dropout_86[0][0]                 
__________________________________________________________________________________________________
contraction_4_1_2 (Conv2D)      (None, 32, 32, 230)  476330      contraction_4_1_1[0][0]          
__________________________________________________________________________________________________
max_pooling2d_45 (MaxPooling2D) (None, 16, 16, 230)  0           contraction_4_1_2[0][0]          
__________________________________________________________________________________________________
batch_normalization_45 (BatchNo (None, 16, 16, 230)  920         max_pooling2d_45[0][0]           
__________________________________________________________________________________________________
dropout_87 (Dropout)            (None, 16, 16, 230)  0           batch_normalization_45[0][0]     
__________________________________________________________________________________________________
contraction_5_1_1 (Conv2D)      (None, 16, 16, 460)  952660      dropout_87[0][0]                 
__________________________________________________________________________________________________
contraction_5_1_2 (Conv2D)      (None, 16, 16, 460)  1904860     contraction_5_1_1[0][0]          
__________________________________________________________________________________________________
max_pooling2d_46 (MaxPooling2D) (None, 8, 8, 460)    0           contraction_5_1_2[0][0]          
__________________________________________________________________________________________________
batch_normalization_46 (BatchNo (None, 8, 8, 460)    1840        max_pooling2d_46[0][0]           
__________________________________________________________________________________________________
dropout_88 (Dropout)            (None, 8, 8, 460)    0           batch_normalization_46[0][0]     
__________________________________________________________________________________________________
contraction_6_1_1 (Conv2D)      (None, 8, 8, 921)    3813861     dropout_88[0][0]                 
__________________________________________________________________________________________________
contraction_6_1_2 (Conv2D)      (None, 8, 8, 921)    7635090     contraction_6_1_1[0][0]          
__________________________________________________________________________________________________
max_pooling2d_47 (MaxPooling2D) (None, 4, 4, 921)    0           contraction_6_1_2[0][0]          
__________________________________________________________________________________________________
batch_normalization_47 (BatchNo (None, 4, 4, 921)    3684        max_pooling2d_47[0][0]           
__________________________________________________________________________________________________
dropout_89 (Dropout)            (None, 4, 4, 921)    0           batch_normalization_47[0][0]     
__________________________________________________________________________________________________
contraction_7_1_1 (Conv2D)      (None, 4, 4, 921)    7635090     dropout_89[0][0]                 
__________________________________________________________________________________________________
contraction_7_1_2 (Conv2D)      (None, 4, 4, 921)    7635090     contraction_7_1_1[0][0]          
__________________________________________________________________________________________________
conv2d_transpose_42 (Conv2DTran (None, 8, 8, 921)    7635090     contraction_7_1_2[0][0]          
__________________________________________________________________________________________________
concatenate_42 (Concatenate)    (None, 8, 8, 1842)   0           conv2d_transpose_42[0][0]        
                                                                 contraction_6_1_2[0][0]          
__________________________________________________________________________________________________
dropout_90 (Dropout)            (None, 8, 8, 1842)   0           concatenate_42[0][0]             
__________________________________________________________________________________________________
expansion_1_1 (Conv2D)          (None, 8, 8, 921)    15269259    dropout_90[0][0]                 
__________________________________________________________________________________________________
expansion_1_2 (Conv2D)          (None, 8, 8, 921)    7635090     expansion_1_1[0][0]              
__________________________________________________________________________________________________
conv2d_transpose_43 (Conv2DTran (None, 16, 16, 460)  3813400     expansion_1_2[0][0]              
__________________________________________________________________________________________________
concatenate_43 (Concatenate)    (None, 16, 16, 920)  0           conv2d_transpose_43[0][0]        
                                                                 contraction_5_1_2[0][0]          
__________________________________________________________________________________________________
dropout_91 (Dropout)            (None, 16, 16, 920)  0           concatenate_43[0][0]             
__________________________________________________________________________________________________
expansion_2_1 (Conv2D)          (None, 16, 16, 460)  3809260     dropout_91[0][0]                 
__________________________________________________________________________________________________
expansion_2_2 (Conv2D)          (None, 16, 16, 460)  1904860     expansion_2_1[0][0]              
__________________________________________________________________________________________________
conv2d_transpose_44 (Conv2DTran (None, 32, 32, 230)  952430      expansion_2_2[0][0]              
__________________________________________________________________________________________________
concatenate_44 (Concatenate)    (None, 32, 32, 460)  0           conv2d_transpose_44[0][0]        
                                                                 contraction_4_1_2[0][0]          
__________________________________________________________________________________________________
dropout_92 (Dropout)            (None, 32, 32, 460)  0           concatenate_44[0][0]             
__________________________________________________________________________________________________
expansion_3_1 (Conv2D)          (None, 32, 32, 230)  952430      dropout_92[0][0]                 
__________________________________________________________________________________________________
expansion_3_2 (Conv2D)          (None, 32, 32, 230)  476330      expansion_3_1[0][0]              
__________________________________________________________________________________________________
conv2d_transpose_45 (Conv2DTran (None, 64, 64, 115)  238165      expansion_3_2[0][0]              
__________________________________________________________________________________________________
concatenate_45 (Concatenate)    (None, 64, 64, 230)  0           conv2d_transpose_45[0][0]        
                                                                 contraction_3_1_2[0][0]          
__________________________________________________________________________________________________
dropout_93 (Dropout)            (None, 64, 64, 230)  0           concatenate_45[0][0]             
__________________________________________________________________________________________________
expansion_4_1 (Conv2D)          (None, 64, 64, 115)  238165      dropout_93[0][0]                 
__________________________________________________________________________________________________
expansion_4_2 (Conv2D)          (None, 64, 64, 115)  119140      expansion_4_1[0][0]              
__________________________________________________________________________________________________
conv2d_transpose_46 (Conv2DTran (None, 128, 128, 57) 59052       expansion_4_2[0][0]              
__________________________________________________________________________________________________
concatenate_46 (Concatenate)    (None, 128, 128, 114 0           conv2d_transpose_46[0][0]        
                                                                 contraction_2_1_2[0][0]          
__________________________________________________________________________________________________
dropout_94 (Dropout)            (None, 128, 128, 114 0           concatenate_46[0][0]             
__________________________________________________________________________________________________
expansion_5_1 (Conv2D)          (None, 128, 128, 57) 58539       dropout_94[0][0]                 
__________________________________________________________________________________________________
expansion_5_2 (Conv2D)          (None, 128, 128, 57) 29298       expansion_5_1[0][0]              
__________________________________________________________________________________________________
conv2d_transpose_47 (Conv2DTran (None, 256, 256, 28) 14392       expansion_5_2[0][0]              
__________________________________________________________________________________________________
concatenate_47 (Concatenate)    (None, 256, 256, 56) 0           conv2d_transpose_47[0][0]        
                                                                 contraction_1_2[0][0]            
__________________________________________________________________________________________________
dropout_95 (Dropout)            (None, 256, 256, 56) 0           concatenate_47[0][0]             
__________________________________________________________________________________________________
expansion_6_1 (Conv2D)          (None, 256, 256, 28) 14140       dropout_95[0][0]                 
__________________________________________________________________________________________________
expansion_6_2 (Conv2D)          (None, 256, 256, 28) 7084        expansion_6_1[0][0]              
__________________________________________________________________________________________________
output (Conv2D)                 (None, 256, 256, 1)  29          expansion_6_2[0][0]              
==================================================================================================
Total params: 73,753,991
Trainable params: 73,750,369
Non-trainable params: 3,622
__________________________________________________________________________________________________
