Model: "unet_v3"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_9 (InputLayer)            [(None, 256, 256, 1) 0                                            
__________________________________________________________________________________________________
contraction_1_1 (Conv2D)        (None, 256, 256, 32) 320         input_9[0][0]                    
__________________________________________________________________________________________________
contraction_1_2 (Conv2D)        (None, 256, 256, 32) 9248        contraction_1_1[0][0]            
__________________________________________________________________________________________________
max_pooling2d_48 (MaxPooling2D) (None, 128, 128, 32) 0           contraction_1_2[0][0]            
__________________________________________________________________________________________________
batch_normalization_48 (BatchNo (None, 128, 128, 32) 128         max_pooling2d_48[0][0]           
__________________________________________________________________________________________________
dropout_96 (Dropout)            (None, 128, 128, 32) 0           batch_normalization_48[0][0]     
__________________________________________________________________________________________________
contraction_2_1_1 (Conv2D)      (None, 128, 128, 64) 18496       dropout_96[0][0]                 
__________________________________________________________________________________________________
contraction_2_1_2 (Conv2D)      (None, 128, 128, 64) 36928       contraction_2_1_1[0][0]          
__________________________________________________________________________________________________
max_pooling2d_49 (MaxPooling2D) (None, 64, 64, 64)   0           contraction_2_1_2[0][0]          
__________________________________________________________________________________________________
batch_normalization_49 (BatchNo (None, 64, 64, 64)   256         max_pooling2d_49[0][0]           
__________________________________________________________________________________________________
dropout_97 (Dropout)            (None, 64, 64, 64)   0           batch_normalization_49[0][0]     
__________________________________________________________________________________________________
contraction_3_1_1 (Conv2D)      (None, 64, 64, 128)  73856       dropout_97[0][0]                 
__________________________________________________________________________________________________
contraction_3_1_2 (Conv2D)      (None, 64, 64, 128)  147584      contraction_3_1_1[0][0]          
__________________________________________________________________________________________________
max_pooling2d_50 (MaxPooling2D) (None, 32, 32, 128)  0           contraction_3_1_2[0][0]          
__________________________________________________________________________________________________
batch_normalization_50 (BatchNo (None, 32, 32, 128)  512         max_pooling2d_50[0][0]           
__________________________________________________________________________________________________
dropout_98 (Dropout)            (None, 32, 32, 128)  0           batch_normalization_50[0][0]     
__________________________________________________________________________________________________
contraction_4_1_1 (Conv2D)      (None, 32, 32, 256)  295168      dropout_98[0][0]                 
__________________________________________________________________________________________________
contraction_4_1_2 (Conv2D)      (None, 32, 32, 256)  590080      contraction_4_1_1[0][0]          
__________________________________________________________________________________________________
max_pooling2d_51 (MaxPooling2D) (None, 16, 16, 256)  0           contraction_4_1_2[0][0]          
__________________________________________________________________________________________________
batch_normalization_51 (BatchNo (None, 16, 16, 256)  1024        max_pooling2d_51[0][0]           
__________________________________________________________________________________________________
dropout_99 (Dropout)            (None, 16, 16, 256)  0           batch_normalization_51[0][0]     
__________________________________________________________________________________________________
contraction_5_1_1 (Conv2D)      (None, 16, 16, 512)  1180160     dropout_99[0][0]                 
__________________________________________________________________________________________________
contraction_5_1_2 (Conv2D)      (None, 16, 16, 512)  2359808     contraction_5_1_1[0][0]          
__________________________________________________________________________________________________
max_pooling2d_52 (MaxPooling2D) (None, 8, 8, 512)    0           contraction_5_1_2[0][0]          
__________________________________________________________________________________________________
batch_normalization_52 (BatchNo (None, 8, 8, 512)    2048        max_pooling2d_52[0][0]           
__________________________________________________________________________________________________
dropout_100 (Dropout)           (None, 8, 8, 512)    0           batch_normalization_52[0][0]     
__________________________________________________________________________________________________
contraction_6_1_1 (Conv2D)      (None, 8, 8, 1024)   4719616     dropout_100[0][0]                
__________________________________________________________________________________________________
contraction_6_1_2 (Conv2D)      (None, 8, 8, 1024)   9438208     contraction_6_1_1[0][0]          
__________________________________________________________________________________________________
max_pooling2d_53 (MaxPooling2D) (None, 4, 4, 1024)   0           contraction_6_1_2[0][0]          
__________________________________________________________________________________________________
batch_normalization_53 (BatchNo (None, 4, 4, 1024)   4096        max_pooling2d_53[0][0]           
__________________________________________________________________________________________________
dropout_101 (Dropout)           (None, 4, 4, 1024)   0           batch_normalization_53[0][0]     
__________________________________________________________________________________________________
contraction_7_1_1 (Conv2D)      (None, 4, 4, 1024)   9438208     dropout_101[0][0]                
__________________________________________________________________________________________________
contraction_7_1_2 (Conv2D)      (None, 4, 4, 1024)   9438208     contraction_7_1_1[0][0]          
__________________________________________________________________________________________________
conv2d_transpose_48 (Conv2DTran (None, 8, 8, 1024)   9438208     contraction_7_1_2[0][0]          
__________________________________________________________________________________________________
concatenate_48 (Concatenate)    (None, 8, 8, 2048)   0           conv2d_transpose_48[0][0]        
                                                                 contraction_6_1_2[0][0]          
__________________________________________________________________________________________________
dropout_102 (Dropout)           (None, 8, 8, 2048)   0           concatenate_48[0][0]             
__________________________________________________________________________________________________
expansion_1_1 (Conv2D)          (None, 8, 8, 1024)   18875392    dropout_102[0][0]                
__________________________________________________________________________________________________
expansion_1_2 (Conv2D)          (None, 8, 8, 1024)   9438208     expansion_1_1[0][0]              
__________________________________________________________________________________________________
conv2d_transpose_49 (Conv2DTran (None, 16, 16, 512)  4719104     expansion_1_2[0][0]              
__________________________________________________________________________________________________
concatenate_49 (Concatenate)    (None, 16, 16, 1024) 0           conv2d_transpose_49[0][0]        
                                                                 contraction_5_1_2[0][0]          
__________________________________________________________________________________________________
dropout_103 (Dropout)           (None, 16, 16, 1024) 0           concatenate_49[0][0]             
__________________________________________________________________________________________________
expansion_2_1 (Conv2D)          (None, 16, 16, 512)  4719104     dropout_103[0][0]                
__________________________________________________________________________________________________
expansion_2_2 (Conv2D)          (None, 16, 16, 512)  2359808     expansion_2_1[0][0]              
__________________________________________________________________________________________________
conv2d_transpose_50 (Conv2DTran (None, 32, 32, 256)  1179904     expansion_2_2[0][0]              
__________________________________________________________________________________________________
concatenate_50 (Concatenate)    (None, 32, 32, 512)  0           conv2d_transpose_50[0][0]        
                                                                 contraction_4_1_2[0][0]          
__________________________________________________________________________________________________
dropout_104 (Dropout)           (None, 32, 32, 512)  0           concatenate_50[0][0]             
__________________________________________________________________________________________________
expansion_3_1 (Conv2D)          (None, 32, 32, 256)  1179904     dropout_104[0][0]                
__________________________________________________________________________________________________
expansion_3_2 (Conv2D)          (None, 32, 32, 256)  590080      expansion_3_1[0][0]              
__________________________________________________________________________________________________
conv2d_transpose_51 (Conv2DTran (None, 64, 64, 128)  295040      expansion_3_2[0][0]              
__________________________________________________________________________________________________
concatenate_51 (Concatenate)    (None, 64, 64, 256)  0           conv2d_transpose_51[0][0]        
                                                                 contraction_3_1_2[0][0]          
__________________________________________________________________________________________________
dropout_105 (Dropout)           (None, 64, 64, 256)  0           concatenate_51[0][0]             
__________________________________________________________________________________________________
expansion_4_1 (Conv2D)          (None, 64, 64, 128)  295040      dropout_105[0][0]                
__________________________________________________________________________________________________
expansion_4_2 (Conv2D)          (None, 64, 64, 128)  147584      expansion_4_1[0][0]              
__________________________________________________________________________________________________
conv2d_transpose_52 (Conv2DTran (None, 128, 128, 64) 73792       expansion_4_2[0][0]              
__________________________________________________________________________________________________
concatenate_52 (Concatenate)    (None, 128, 128, 128 0           conv2d_transpose_52[0][0]        
                                                                 contraction_2_1_2[0][0]          
__________________________________________________________________________________________________
dropout_106 (Dropout)           (None, 128, 128, 128 0           concatenate_52[0][0]             
__________________________________________________________________________________________________
expansion_5_1 (Conv2D)          (None, 128, 128, 64) 73792       dropout_106[0][0]                
__________________________________________________________________________________________________
expansion_5_2 (Conv2D)          (None, 128, 128, 64) 36928       expansion_5_1[0][0]              
__________________________________________________________________________________________________
conv2d_transpose_53 (Conv2DTran (None, 256, 256, 32) 18464       expansion_5_2[0][0]              
__________________________________________________________________________________________________
concatenate_53 (Concatenate)    (None, 256, 256, 64) 0           conv2d_transpose_53[0][0]        
                                                                 contraction_1_2[0][0]            
__________________________________________________________________________________________________
dropout_107 (Dropout)           (None, 256, 256, 64) 0           concatenate_53[0][0]             
__________________________________________________________________________________________________
expansion_6_1 (Conv2D)          (None, 256, 256, 32) 18464       dropout_107[0][0]                
__________________________________________________________________________________________________
expansion_6_2 (Conv2D)          (None, 256, 256, 32) 9248        expansion_6_1[0][0]              
__________________________________________________________________________________________________
output (Conv2D)                 (None, 256, 256, 1)  33          expansion_6_2[0][0]              
==================================================================================================
Total params: 91,222,049
Trainable params: 91,218,017
Non-trainable params: 4,032
__________________________________________________________________________________________________
