Model: "unet_v3"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 256, 320, 1) 0                                            
__________________________________________________________________________________________________
contraction_1_1 (Conv2D)        (None, 256, 320, 16) 160         input_2[0][0]                    
__________________________________________________________________________________________________
contraction_1_2 (Conv2D)        (None, 256, 320, 16) 2320        contraction_1_1[0][0]            
__________________________________________________________________________________________________
max_pooling2d_6 (MaxPooling2D)  (None, 128, 160, 16) 0           contraction_1_2[0][0]            
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 128, 160, 16) 64          max_pooling2d_6[0][0]            
__________________________________________________________________________________________________
dropout_12 (Dropout)            (None, 128, 160, 16) 0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
contraction_2_1_1 (Conv2D)      (None, 128, 160, 32) 4640        dropout_12[0][0]                 
__________________________________________________________________________________________________
contraction_2_1_2 (Conv2D)      (None, 128, 160, 32) 9248        contraction_2_1_1[0][0]          
__________________________________________________________________________________________________
max_pooling2d_7 (MaxPooling2D)  (None, 64, 80, 32)   0           contraction_2_1_2[0][0]          
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 64, 80, 32)   128         max_pooling2d_7[0][0]            
__________________________________________________________________________________________________
dropout_13 (Dropout)            (None, 64, 80, 32)   0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
contraction_3_1_1 (Conv2D)      (None, 64, 80, 64)   18496       dropout_13[0][0]                 
__________________________________________________________________________________________________
contraction_3_1_2 (Conv2D)      (None, 64, 80, 64)   36928       contraction_3_1_1[0][0]          
__________________________________________________________________________________________________
max_pooling2d_8 (MaxPooling2D)  (None, 32, 40, 64)   0           contraction_3_1_2[0][0]          
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 32, 40, 64)   256         max_pooling2d_8[0][0]            
__________________________________________________________________________________________________
dropout_14 (Dropout)            (None, 32, 40, 64)   0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
contraction_4_1_1 (Conv2D)      (None, 32, 40, 128)  73856       dropout_14[0][0]                 
__________________________________________________________________________________________________
contraction_4_1_2 (Conv2D)      (None, 32, 40, 128)  147584      contraction_4_1_1[0][0]          
__________________________________________________________________________________________________
max_pooling2d_9 (MaxPooling2D)  (None, 16, 20, 128)  0           contraction_4_1_2[0][0]          
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 16, 20, 128)  512         max_pooling2d_9[0][0]            
__________________________________________________________________________________________________
dropout_15 (Dropout)            (None, 16, 20, 128)  0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
contraction_5_1_1 (Conv2D)      (None, 16, 20, 256)  295168      dropout_15[0][0]                 
__________________________________________________________________________________________________
contraction_5_1_2 (Conv2D)      (None, 16, 20, 256)  590080      contraction_5_1_1[0][0]          
__________________________________________________________________________________________________
max_pooling2d_10 (MaxPooling2D) (None, 8, 10, 256)   0           contraction_5_1_2[0][0]          
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 8, 10, 256)   1024        max_pooling2d_10[0][0]           
__________________________________________________________________________________________________
dropout_16 (Dropout)            (None, 8, 10, 256)   0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
contraction_6_1_1 (Conv2D)      (None, 8, 10, 512)   1180160     dropout_16[0][0]                 
__________________________________________________________________________________________________
contraction_6_1_2 (Conv2D)      (None, 8, 10, 512)   2359808     contraction_6_1_1[0][0]          
__________________________________________________________________________________________________
max_pooling2d_11 (MaxPooling2D) (None, 4, 5, 512)    0           contraction_6_1_2[0][0]          
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 4, 5, 512)    2048        max_pooling2d_11[0][0]           
__________________________________________________________________________________________________
dropout_17 (Dropout)            (None, 4, 5, 512)    0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
contraction_7_1_1 (Conv2D)      (None, 4, 5, 512)    2359808     dropout_17[0][0]                 
__________________________________________________________________________________________________
contraction_7_1_2 (Conv2D)      (None, 4, 5, 512)    2359808     contraction_7_1_1[0][0]          
__________________________________________________________________________________________________
conv2d_transpose_6 (Conv2DTrans (None, 8, 10, 512)   2359808     contraction_7_1_2[0][0]          
__________________________________________________________________________________________________
concatenate_6 (Concatenate)     (None, 8, 10, 1024)  0           conv2d_transpose_6[0][0]         
                                                                 contraction_6_1_2[0][0]          
__________________________________________________________________________________________________
dropout_18 (Dropout)            (None, 8, 10, 1024)  0           concatenate_6[0][0]              
__________________________________________________________________________________________________
expansion_1_1 (Conv2D)          (None, 8, 10, 512)   4719104     dropout_18[0][0]                 
__________________________________________________________________________________________________
expansion_1_2 (Conv2D)          (None, 8, 10, 512)   2359808     expansion_1_1[0][0]              
__________________________________________________________________________________________________
conv2d_transpose_7 (Conv2DTrans (None, 16, 20, 256)  1179904     expansion_1_2[0][0]              
__________________________________________________________________________________________________
concatenate_7 (Concatenate)     (None, 16, 20, 512)  0           conv2d_transpose_7[0][0]         
                                                                 contraction_5_1_2[0][0]          
__________________________________________________________________________________________________
dropout_19 (Dropout)            (None, 16, 20, 512)  0           concatenate_7[0][0]              
__________________________________________________________________________________________________
expansion_2_1 (Conv2D)          (None, 16, 20, 256)  1179904     dropout_19[0][0]                 
__________________________________________________________________________________________________
expansion_2_2 (Conv2D)          (None, 16, 20, 256)  590080      expansion_2_1[0][0]              
__________________________________________________________________________________________________
conv2d_transpose_8 (Conv2DTrans (None, 32, 40, 128)  295040      expansion_2_2[0][0]              
__________________________________________________________________________________________________
concatenate_8 (Concatenate)     (None, 32, 40, 256)  0           conv2d_transpose_8[0][0]         
                                                                 contraction_4_1_2[0][0]          
__________________________________________________________________________________________________
dropout_20 (Dropout)            (None, 32, 40, 256)  0           concatenate_8[0][0]              
__________________________________________________________________________________________________
expansion_3_1 (Conv2D)          (None, 32, 40, 128)  295040      dropout_20[0][0]                 
__________________________________________________________________________________________________
expansion_3_2 (Conv2D)          (None, 32, 40, 128)  147584      expansion_3_1[0][0]              
__________________________________________________________________________________________________
conv2d_transpose_9 (Conv2DTrans (None, 64, 80, 64)   73792       expansion_3_2[0][0]              
__________________________________________________________________________________________________
concatenate_9 (Concatenate)     (None, 64, 80, 128)  0           conv2d_transpose_9[0][0]         
                                                                 contraction_3_1_2[0][0]          
__________________________________________________________________________________________________
dropout_21 (Dropout)            (None, 64, 80, 128)  0           concatenate_9[0][0]              
__________________________________________________________________________________________________
expansion_4_1 (Conv2D)          (None, 64, 80, 64)   73792       dropout_21[0][0]                 
__________________________________________________________________________________________________
expansion_4_2 (Conv2D)          (None, 64, 80, 64)   36928       expansion_4_1[0][0]              
__________________________________________________________________________________________________
conv2d_transpose_10 (Conv2DTran (None, 128, 160, 32) 18464       expansion_4_2[0][0]              
__________________________________________________________________________________________________
concatenate_10 (Concatenate)    (None, 128, 160, 64) 0           conv2d_transpose_10[0][0]        
                                                                 contraction_2_1_2[0][0]          
__________________________________________________________________________________________________
dropout_22 (Dropout)            (None, 128, 160, 64) 0           concatenate_10[0][0]             
__________________________________________________________________________________________________
expansion_5_1 (Conv2D)          (None, 128, 160, 32) 18464       dropout_22[0][0]                 
__________________________________________________________________________________________________
expansion_5_2 (Conv2D)          (None, 128, 160, 32) 9248        expansion_5_1[0][0]              
__________________________________________________________________________________________________
conv2d_transpose_11 (Conv2DTran (None, 256, 320, 16) 4624        expansion_5_2[0][0]              
__________________________________________________________________________________________________
concatenate_11 (Concatenate)    (None, 256, 320, 32) 0           conv2d_transpose_11[0][0]        
                                                                 contraction_1_2[0][0]            
__________________________________________________________________________________________________
dropout_23 (Dropout)            (None, 256, 320, 32) 0           concatenate_11[0][0]             
__________________________________________________________________________________________________
expansion_6_1 (Conv2D)          (None, 256, 320, 16) 4624        dropout_23[0][0]                 
__________________________________________________________________________________________________
expansion_6_2 (Conv2D)          (None, 256, 320, 16) 2320        expansion_6_1[0][0]              
__________________________________________________________________________________________________
output (Conv2D)                 (None, 256, 320, 1)  17          expansion_6_2[0][0]              
==================================================================================================
Total params: 22,810,641
Trainable params: 22,808,625
Non-trainable params: 2,016
__________________________________________________________________________________________________